Protected Member Functions | Friends | List of all members
ACAPI::ModifierBase Class Reference
Command Scopes
Base class of every Modifier classes used in ExecuteUndoableScope/ExecuteNotUndoableScope/CallDefaultModifier function. More...
#include <ModifyScope.hpp>
 Protected Member Functions
 virtual void  | FinalizeModification ()
 Friends
 template<typename Modifier , typename UnaryInvocable >
ACAPI::Result< void >  | ExecuteUndoableScope (const UnaryInvocable &, Modifier &, const ACAPI::Object &, const GS::UniString &)
 template<typename Modifier , typename UnaryInvocable >
ACAPI::Result< void >  | ExecuteNotUndoableScope (const UnaryInvocable &, Modifier &, const ACAPI::Object &)
 template<typename Modifier , typename UnaryInvocable >
ACAPI::Result< void >  | CallDefaultModifier (UnaryInvocable &&, Modifier &)
Detailed Description
Base class of every Modifier classes used in ExecuteUndoableScope/ExecuteNotUndoableScope/CallDefaultModifier function.